papers/cppnow24/concept_maps.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<meta name="description" content="
"/>
<meta name="keywords" content=" "/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="./my_theme.css" id="theme"/>

<link rel="stylesheet" href="./operandi-tinted.css"/>

<link rel="stylesheet" href="./footer.css"/>

<link rel="stylesheet" type="text/css" href="./operandi-tinted.css" />
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="./concept_maps_title.png">

</section>
<section>
<section id="slide-org1b30091">
<h2 id="org1b30091">Concept Maps using C++23 Library Tech</h2>
<p>
Steve Downey
</p>

<p>
© 2023 Bloomberg Finance L.P. All rights reserved.
</p>
</section>
</section>
<section>
<section id="slide-orgb113a4b">
<h2 id="orgb113a4b">Abstract</h2>
<p>
C++0x Concepts had a feature <code>Concept Maps</code> that allowed a set of functions, types, and template definitions to be associated with a concept and the map to be specialized for types that meet the concept.
</p>

<p class="fragment (appear)">
This allowed open extension of a concept.
</p>

<p class="fragment (appear)">
A definition could be provided that allows an algorithm to operate in terms of the API a concept presents and the map would define how those operations are implemented for a particular type.
</p>

<ul>
<li class="fragment appear">This is similar to how Haskell's <code>typeclass</code> works.</li>

</ul>


<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org878675e">
<h3 id="org878675e">Lost with <code>Concepts-Lite</code></h3>
<aside class="notes">
<p>
The feature was very general, and lost as part of the <code>Concepts-Lite</code> proposal that was eventually adopted.
</p>

<p>
This loss of a level of indirection means that the APIs for a concept must be implemented by those names for a type, even when those names are not particularly good choices in the natural domain of a type rather than in the domain as a concept.
</p>

<p>
The proliferation of <code>transform</code> functions for functorial <code>map</code> is such a problem.
</p>

<p>
It is also a problem when adapting types that are closed for extension or do not permit member functions.
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org7417c38">
<h2 id="org7417c38">Why?</h2>
<ul>
<li class="fragment appear"><p>
Don't know if you should
</p></li>
<li class="fragment appear">Need to know if you could first</li>

</ul>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org63d6135">
<h3 id="org63d6135">Alternatives</h3>
<ul>
<li class="fragment appear"><p>
Virtual Interface
</p></li>
<li class="fragment appear"><p>
Adapters
</p></li>
<li class="fragment appear">Collection of CPOs</li>

</ul>
<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org9609628">
<h3 id="org9609628">Hard to Support</h3>
<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orga5b897f">
<h2 id="orga5b897f">Example from C++0x Concepts</h2>
<div class="outline-text-2" id="text-orga5b897f">
</div>
</section>
</section>
<section>
<section id="slide-orgfa73dcf">
<h3 id="orgfa73dcf">Student Record</h3>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">class</span> <span class="org-type">student</span> <span class="org-type">record</span> {
<span class="org-keyword">public</span>:
  <span class="org-type">string</span> <span class="org-variable-name">id</span>;
  <span class="org-type">string</span> <span class="org-variable-name">name</span>;
  <span class="org-type">string</span> <span class="org-variable-name">address</span>;
  <span class="org-type">bool</span>   <span class="org-function-name">id_equal</span>(<span class="org-keyword">const</span> <span class="org-type">student</span> <span class="org-type">record</span>&amp;);
  <span class="org-type">bool</span>   <span class="org-function-name">name_equal</span>(<span class="org-keyword">const</span> <span class="org-type">student</span> <span class="org-type">record</span>&amp;);
  <span class="org-type">bool</span>   <span class="org-function-name">address_equal</span>(<span class="org-keyword">const</span> <span class="org-type">student</span> <span class="org-type">record</span>&amp;);
};
</pre>
</div>
<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org360e8cc">
<h3 id="org360e8cc">Equality Comparable</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">concept_map</span> <span class="org-type">EqualityComparable</span><span class="org-variable-name">&lt;student record&gt;</span>{
    <span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-variable-name">==</span>(<span class="org-keyword">const</span> <span class="org-type">student</span> <span class="org-type">record</span>&amp; <span class="org-variable-name">a</span>,
                    <span class="org-keyword">const</span> <span class="org-type">student</span> <span class="org-type">record</span>&amp; <span class="org-variable-name">b</span>){
        <span class="org-keyword">return</span> a.id_equal(b);
}
};
</pre>
</div>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgd2ea345">
<h3 id="orgd2ea345">Allow associated types</h3>
<p>
Very useful for pointers
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">concept_map</span> <span class="org-type">BinaryFunction</span><span class="org-variable-name">&lt;int (*)(int, int), int, int&gt;</span>
{
    <span class="org-keyword">typedef</span> <span class="org-type">int</span> <span class="org-type">result_type</span>;
};
</pre>
</div>


<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org65348c8">
<h3 id="org65348c8">Why Didn't We Get Them</h3>
<p>
Lets not go there right now.
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org689c337">
<h2 id="org689c337">State of the Art</h2>
<div class="outline-text-2" id="text-org689c337">
</div>
</section>
</section>
<section>
<section id="slide-org97ab0dc">
<h3 id="org97ab0dc">Rust Traits</h3>
<div class="org-src-container">

<pre class="src src-rust"><span class="org-keyword">trait</span> <span class="org-type">PartialEq</span> {
    <span class="org-keyword">fn</span> <span class="org-function-name">eq</span>(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">self</span>, <span class="org-variable-name">rhs</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">Self</span>) -&gt; <span class="org-type">bool</span>;

    <span class="org-keyword">fn</span> <span class="org-function-name">ne</span>(<span class="org-rust-ampersand">&amp;</span><span class="org-keyword">self</span>, <span class="org-variable-name">rhs</span>: <span class="org-rust-ampersand">&amp;</span><span class="org-type">Self</span>) -&gt; <span class="org-type">bool</span> {
        !<span class="org-keyword">self</span>.eq(rhs)
    }
}
</pre>
</div>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
