papers/cppnow24/concept_maps.org
*** Some Concepts and Types
#+begin_src C++
namespace N::hidden {
template <typename T>
concept has_eq = requires(T const& v) {
  { eq(v, v) } -> std::same_as<bool>;
};

struct eq_fn {
  template <has_eq T>
  constexpr bool operator()(T const& x,
                            T const& y) const {
    return eq(x, y);
  }
};

template <has_eq T>
constexpr bool ne(T const& x, T const& y) {
  return not eq(x, y);
}

template <typename T>
concept has_ne = requires(T const& v) {
  { ne(v, v) } -> std::same_as<bool>;
};

struct ne_fn {
  template <has_ne T>
  constexpr bool operator()(T const& x,
                            T const& y) const {
    return ne(x, y);
  }
};
} // namespace N::hidden
#+end_src

See _Why tag_invoke is not the solution I want_ by Barry Revzin
https://brevzin.github.io/c++/2020/12/01/tag-invoke/
#+begin_notes

#+end_notes
*** C++ partial_equality
#+begin_src C++
namespace N {
inline namespace function_objects {
inline constexpr hidden::eq_fn eq{};
inline constexpr hidden::ne_fn ne{};
} // namespace function_objects

template <typename T>
concept partial_equality
  requires(std::remove_reference_t<T> const& t)
{
  eq(t, t);
  ne(t, t);
};
} // namespace N
#+end_src
See _Why tag_invoke is not the solution I want_ by Barry Revzin
https://brevzin.github.io/c++/2020/12/01/tag-invoke/

#+begin_notes

#+end_notes
* Requirements for Solution
    #+ATTR_REVEAL: :frag (appear)
- Tied to the typesystem
    #+ATTR_REVEAL: :frag (appear)
- Automatable
    #+ATTR_REVEAL: :frag (appear)
- "zero" overhead
    #+ATTR_REVEAL: :frag (appear)
  - no virtual calls
    #+ATTR_REVEAL: :frag (appear)
  - no type erasure

#+begin_notes

#+end_notes
* What does typeclass do?
Adds a record to the function that defines the operations for the type.

Can we do that?

#+begin_notes

#+end_notes
* Type based lookup
Templates!

#+begin_notes

#+end_notes
* Additional Requirement
Avoid ADL
    #+ATTR_REVEAL: :frag (appear)
Object Lookup rather than Overload Lookup

#+begin_notes

#+end_notes
* Template Variables
Template variables have become more powerful

    #+ATTR_REVEAL: :frag (appear)
We can have entirely distinct specializations

#+begin_notes

#+end_notes
** A Step Towards Implementation
#+begin_src C++
template <class T>
concept partial_equality = requires(
    std::remove_reference_t<T> const& t) {
  {
    partial_eq<T>.eq(t, t)
  } -> std::same_as<bool>;
  {
    partial_eq<T>.ne(t, t)
  } -> std::same_as<bool>;
};
#+end_src

#+begin_notes

#+end_notes
** ~partial_eq<T>~
*** An inline variable object
#+begin_src c++
template<class T>
constexpr inline auto partial_eq = hidden::partial_eq_default;
#+end_src

#+begin_notes

#+end_notes
*** A default implementation

#+begin_src C++
constexpr inline struct partial_eq_default_t {
  constexpr bool
  eq(has_eq auto const& rhs,
     has_eq auto const& lhs) const {
    return (rhs == lhs);
  }
  constexpr bool
  ne(has_eq auto const& rhs,
     has_eq auto const& lhs) const {
    return (lhs != rhs);
  }
} partial_eq_default;
#+end_src

#+begin_notes

#+end_notes
*** New ~has_eq~

#+begin_src c++
template <typename T>
concept has_eq = requires(T const& v) {
  { operator==(v, v) } -> std::same_as<bool>;
};
#+end_src
#+begin_notes

#+end_notes
** Will do better
In a bit


#+begin_notes

#+end_notes

* Monoid
#+ATTR_REVEAL: :frag (appear)
A little more than you think.

#+ATTR_REVEAL: :frag (appear)
- A type
- With an associative binary operation
- Which is closed
- And has an identity element
** Maybe not a lot more


#+begin_notes

#+end_notes
