papers/cppnow24/concept_maps.html
<section>
<section id="slide-org9c9e280">
<h3 id="org9c9e280">C++ CPOs</h3>
<div class="outline-text-3" id="text-org9c9e280">
</div>
</section>
</section>
<section>
<section id="slide-orgb2be569">
<h4 id="orgb2be569">Some Concepts and Types</h4>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">namespace</span> <span class="org-constant">N</span>::<span class="org-constant">hidden</span> {
<span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">concept</span> <span class="org-type">has_eq</span> = <span class="org-keyword">requires</span>(<span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">v</span>) {
  { eq(v, v) } -&gt; <span class="org-constant">std</span>::<span class="org-type">same_as</span>&lt;<span class="org-type">bool</span>&gt;;
};

<span class="org-keyword">struct</span> <span class="org-type">eq_fn</span> {
  <span class="org-keyword">template</span> &lt;<span class="org-type">has_eq</span> <span class="org-type">T</span>&gt;
  <span class="org-keyword">constexpr</span> <span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span>(<span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">x</span>,
                            <span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">y</span>) <span class="org-keyword">const</span> {
    <span class="org-keyword">return</span> eq(x, y);
  }
};

<span class="org-keyword">template</span> &lt;<span class="org-type">has_eq</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">constexpr</span> <span class="org-type">bool</span> <span class="org-function-name">ne</span>(<span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">x</span>, <span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">y</span>) {
  <span class="org-keyword">return</span> <span class="org-keyword">not</span> eq(x, y);
}

<span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">concept</span> <span class="org-type">has_ne</span> = <span class="org-keyword">requires</span>(<span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">v</span>) {
  { ne(v, v) } -&gt; <span class="org-constant">std</span>::<span class="org-type">same_as</span>&lt;<span class="org-type">bool</span>&gt;;
};

<span class="org-keyword">struct</span> <span class="org-type">ne_fn</span> {
  <span class="org-keyword">template</span> &lt;<span class="org-type">has_ne</span> <span class="org-type">T</span>&gt;
  <span class="org-keyword">constexpr</span> <span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span>(<span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">x</span>,
                            <span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">y</span>) <span class="org-keyword">const</span> {
    <span class="org-keyword">return</span> ne(x, y);
  }
};
} <span class="org-comment-delimiter">// </span><span class="org-comment">namespace N::hidden</span>
</pre>
</div>

<p>
See <span class="underline">Why tag_invoke is not the solution I want</span> by Barry Revzin
<a href="https://brevzin.github.io/c++/2020/12/01/tag-invoke/">https://brevzin.github.io/c++/2020/12/01/tag-invoke/</a>
</p>
<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org7c20bf0">
<h4 id="org7c20bf0">C++ partial_equality</h4>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">namespace</span> <span class="org-constant">N</span> {
<span class="org-keyword">inline</span> <span class="org-keyword">namespace</span> <span class="org-constant">function_objects</span> {
<span class="org-keyword">inline</span> <span class="org-keyword">constexpr</span> <span class="org-constant">hidden</span>::<span class="org-type">eq_fn</span> <span class="org-variable-name">eq</span>{};
<span class="org-keyword">inline</span> <span class="org-keyword">constexpr</span> <span class="org-constant">hidden</span>::<span class="org-type">ne_fn</span> <span class="org-variable-name">ne</span>{};
} <span class="org-comment-delimiter">// </span><span class="org-comment">namespace function_objects</span>

<span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">concept</span> partial_equality
  <span class="org-keyword">requires</span>(<span class="org-constant">std</span>::<span class="org-type">remove_reference_t</span>&lt;<span class="org-type">T</span>&gt; <span class="org-keyword">const</span>&amp; <span class="org-variable-name">t</span>)
{
  eq(t, t);
  ne(t, t);
};
} <span class="org-comment-delimiter">// </span><span class="org-comment">namespace N</span>
</pre>
</div>
<p>
See <span class="underline">Why tag_invoke is not the solution I want</span> by Barry Revzin
<a href="https://brevzin.github.io/c++/2020/12/01/tag-invoke/">https://brevzin.github.io/c++/2020/12/01/tag-invoke/</a>
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org51e45f7">
<h2 id="org51e45f7">Requirements for Solution</h2>
<ul>
<li class="fragment appear"><p>
Tied to the typesystem
</p></li>
<li class="fragment appear"><p>
Automatable
</p></li>
<li class="fragment appear">"zero" overhead
<ul>
<li class="fragment appear"><p>
no virtual calls
</p></li>
<li class="fragment appear">no type erasure</li>

</ul></li>

</ul>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orged69f60">
<h2 id="orged69f60">What does typeclass do?</h2>
<p>
Adds a record to the function that defines the operations for the type.
</p>

<p>
Can we do that?
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org0803f74">
<h2 id="org0803f74">Type based lookup</h2>
<p>
Templates!
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgca9cf6c">
<h2 id="orgca9cf6c">Additional Requirement</h2>
<p>
Avoid ADL
</p>
<p class="fragment (appear)">
Object Lookup rather than Overload Lookup
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org62bd849">
<h2 id="org62bd849">Template Variables</h2>
<p>
Template variables have become more powerful
</p>

<p class="fragment (appear)">
We can have entirely distinct specializations
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgc21943d">
<h3 id="orgc21943d">A Step Towards Implementation</h3>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">class</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">concept</span> <span class="org-type">partial_equality</span> = <span class="org-keyword">requires</span>(
    <span class="org-constant">std</span>::<span class="org-type">remove_reference_t</span>&lt;<span class="org-type">T</span>&gt; <span class="org-keyword">const</span>&amp; <span class="org-variable-name">t</span>) {
  {
    <span class="org-type">partial_eq</span>&lt;<span class="org-type">T</span>&gt;.eq(t, t)
  } -&gt; <span class="org-constant">std</span>::<span class="org-type">same_as</span>&lt;<span class="org-type">bool</span>&gt;;
  {
    <span class="org-type">partial_eq</span>&lt;<span class="org-type">T</span>&gt;.ne(t, t)
  } -&gt; <span class="org-constant">std</span>::<span class="org-type">same_as</span>&lt;<span class="org-type">bool</span>&gt;;
};
</pre>
</div>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org49d89c5">
<h3 id="org49d89c5"><code>partial_eq&lt;T&gt;</code></h3>
<div class="outline-text-3" id="text-org49d89c5">
</div>
</section>
</section>
<section>
<section id="slide-org6474179">
<h4 id="org6474179">An inline variable object</h4>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">constexpr</span> <span class="org-keyword">inline</span> <span class="org-keyword">auto</span> <span class="org-variable-name">partial_eq</span> = <span class="org-constant">hidden</span>::partial_eq_default;
</pre>
</div>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org3a8de39">
<h4 id="org3a8de39">A default implementation</h4>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">constexpr</span> <span class="org-keyword">inline</span> <span class="org-keyword">struct</span> <span class="org-type">partial_eq_default_t</span> {
  <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>
  <span class="org-function-name">eq</span>(<span class="org-type">has_eq</span> <span class="org-keyword">auto</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">rhs</span>,
     <span class="org-type">has_eq</span> <span class="org-keyword">auto</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">lhs</span>) <span class="org-keyword">const</span> {
    <span class="org-keyword">return</span> (rhs == lhs);
  }
  <span class="org-keyword">constexpr</span> <span class="org-type">bool</span>
  <span class="org-function-name">ne</span>(<span class="org-type">has_eq</span> <span class="org-keyword">auto</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">rhs</span>,
     <span class="org-type">has_eq</span> <span class="org-keyword">auto</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">lhs</span>) <span class="org-keyword">const</span> {
    <span class="org-keyword">return</span> (lhs != rhs);
  }
} <span class="org-variable-name">partial_eq_default</span>;
</pre>
</div>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgecdea40">
<h4 id="orgecdea40">New <code>has_eq</code></h4>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">concept</span> <span class="org-type">has_eq</span> = <span class="org-keyword">requires</span>(<span class="org-type">T</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">v</span>) {
  { <span class="org-keyword">operator</span>==(v, v) } -&gt; <span class="org-constant">std</span>::<span class="org-type">same_as</span>&lt;<span class="org-type">bool</span>&gt;;
};
</pre>
</div>
<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org79052d9">
<h3 id="org79052d9">Will do better</h3>
<p>
In a bit
</p>


<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgfcb7334">
<h2 id="orgfcb7334">Monoid</h2>
<p class="fragment (appear)">
A little more than you think.
</p>

<ul>
<li class="fragment appear">A type</li>
<li class="fragment appear">With an associative binary operation</li>
<li class="fragment appear">Which is closed</li>
<li class="fragment appear">And has an identity element</li>

</ul>
</section>
</section>
<section>
<section id="slide-org3fa7e7d">
<h3 id="org3fa7e7d">Maybe not a lot more</h3>
<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
