papers/cppnow24/concept_maps.org
** Math
- $\oplus: M \times M \rightarrow M$
- $x \oplus (y \oplus z) = (x \oplus y) \oplus z$
- $1_M \in M$ such that $\forall m \in M : (1_M \oplus m) = m = (m \oplus 1_M)$

#+begin_notes

#+end_notes
** Function form
- $f : M \times M \rightarrow M$
- $f(x, f(y, z)) = f(f(x, y), z)$
- $1_M \in M$ such that $\forall m \in M : f(1_M, m) = m = f(m, 1_M)$

The similarity to left and right fold is *NOT* an accident

#+begin_notes

#+end_notes
** Core Functions
- $empty : m$ :: $empty = concat \, []$
- $concat : [m] \rightarrow m$ :: $fold \, append \, empty$
- $append : m \rightarrow m \rightarrow m$ :: $op$


  Note that it's self-referential

  This is common

#+begin_notes

#+end_notes
*** From Haskell Prelude
#+begin_src haskell
class Semigroup a => Monoid a where
  mempty :: a
  mempty = mconcat []

  mappend :: a -> a -> a
  mappend = (<>)

  mconcat :: [a] -> a
  mconcat = foldr mappend mempty
#+end_src

#+begin_notes

#+end_notes
** Minimum Set
$empty \, | \, concat$

#+begin_notes

#+end_notes
** In C++
#+begin_src C++
template <typename T, typename M>
concept MonoidRequirements =
    requires(T i) {
      { i.identity() } -> std::same_as<M>;
    }
    ||
    requires(T i, std::ranges::empty_view<M> r1) {
      { i.concat(r1) } -> std::same_as<M>;
    };
#+end_src
#+begin_notes
I am ignoring all sorts of const volatile reference issues here.

* Implementing the other side
#+end_notes
** The Map for a Monoid
#+begin_src c++
template <class Impl>
  requires MonoidRequirements<
      Impl,
      typename Impl::value_type>
struct Monoid : protected Impl {
  auto identity(this auto&& self);

  template <typename Range>
  auto concat(this auto&& self, Range r);

  auto op(this auto&& self, auto a1, auto a2);
};
#+end_src
#+begin_notes
empty is a terrible name, concat only a little better.
empty becomes identity

#+end_notes
*** ~identity~
#+begin_src c++
    auto identity(this auto && self) {
        std::puts("Monoid::identity()");
        return self.concat(std::ranges::empty_view<typename Impl::value_type>{});
    }

#+end_src
*** ~concat~
#+begin_src c++
   template<typename Range>
   auto concat(this auto&& self, Range r) {
        std::puts("Monoid::concat()");
        return std::ranges::fold_right(r,
                    self.identity(),
                    [&](auto m1, auto m2){return self.op(m1, m2);});
    }

#+end_src
*** ~op~
#+begin_src c++
   auto op(this auto&& self, auto a1, auto a2) {
        std::puts("Monoid::op");
        return self.op(a1, a2);
    }
#+end_src

** Deducing ~this~ *and* CRTP
We'll see in a moment, but it's because we want to constraint the required implementation.

We want to use the derived version which has all of the operations.

** ~Plus~
#+begin_src C++
template <typename M>
class Plus {
public:
  using value_type = M;
  auto identity(this auto&& self) -> M {
    std::puts("Plus::identity()");
    return M{0};
  }

  auto op(this auto&& self, auto s1, auto s2) -> M {
    std::puts("Plus::op()");
    return s1 + s2;
  }
};
#+end_src

** ~PlusMonoidMap~
#+begin_src c++
template<typename M>
struct PlusMonoidMap : public Monoid<Plus<M>> {
    using Plus<M>::identity;
    using Plus<M>::op;
};
#+end_src
#+begin_notes
Need to pull the operations from the Monoid instance into the Map, so we get the right ones being used by concat.

This might be simpler if we didn't allow choice of the basis operations, but that's also overly restrictive.
#+end_notes

