papers/cppnow24/concept_maps.html
<section>
<section id="slide-org0228983">
<h3 id="org0228983">Math</h3>
<ul>
<li>\(\oplus: M \times M \rightarrow M\)</li>
<li>\(x \oplus (y \oplus z) = (x \oplus y) \oplus z\)</li>
<li>\(1_M \in M\) such that \(\forall m \in M : (1_M \oplus m) = m = (m \oplus 1_M)\)</li>

</ul>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org16e264d">
<h3 id="org16e264d">Function form</h3>
<ul>
<li>\(f : M \times M \rightarrow M\)</li>
<li>\(f(x, f(y, z)) = f(f(x, y), z)\)</li>
<li>\(1_M \in M\) such that \(\forall m \in M : f(1_M, m) = m = f(m, 1_M)\)</li>

</ul>

<p>
The similarity to left and right fold is <b>NOT</b> an accident
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org448c7ce">
<h3 id="org448c7ce">Core Functions</h3>
<dl>
<dt>\(empty : m\)</dt><dd>\(empty = concat \, []\)</dd>
<dt>\(concat : [m] \rightarrow m\)</dt><dd>\(fold \, append \, empty\)</dd>
<dt>\(append : m \rightarrow m \rightarrow m\)</dt><dd>\(op\)</dd>

</dl>


<p>
Note that it's self-referential
</p>

<p>
This is common
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org5c66170">
<h4 id="org5c66170">From Haskell Prelude</h4>
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Semigroup</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-keyword">where</span>
  mempty <span class="org-haskell-operator">::</span> a
  mempty <span class="org-haskell-operator">=</span> mconcat <span class="org-haskell-constructor">[]</span>

  mappend <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
  mappend <span class="org-haskell-operator">=</span> (<span class="org-haskell-operator">&lt;&gt;</span>)

  mconcat <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> a
  mconcat <span class="org-haskell-operator">=</span> foldr mappend mempty
</pre>
</div>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgb2bfa71">
<h3 id="orgb2bfa71">Minimum Set</h3>
<p>
\(empty \, | \, concat\)
</p>

<aside class="notes">
<p>

</p>

</aside>
</section>
</section>
<section>
<section id="slide-org7bd2b77">
<h3 id="org7bd2b77">In C++</h3>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>, <span class="org-keyword">typename</span> <span class="org-type">M</span>&gt;
<span class="org-keyword">concept</span> <span class="org-type">MonoidRequirements</span> =
    <span class="org-keyword">requires</span>(<span class="org-type">T</span> <span class="org-variable-name">i</span>) {
      { i.identity() } -&gt; <span class="org-constant">std</span>::<span class="org-type">same_as</span>&lt;<span class="org-type">M</span>&gt;;
    }
    ||
    <span class="org-keyword">requires</span>(<span class="org-type">T</span> <span class="org-variable-name">i</span>, <span class="org-constant">std</span>::<span class="org-constant">ranges</span>::<span class="org-type">empty_view</span>&lt;<span class="org-type">M</span>&gt; <span class="org-variable-name">r1</span>) {
      { i.concat(r1) } -&gt; <span class="org-constant">std</span>::<span class="org-type">same_as</span>&lt;<span class="org-type">M</span>&gt;;
    };
</pre>
</div>
<p>
#+begin_notes
I am ignoring all sorts of const volatile reference issues here.
</p>
</section>
</section>
<section>
<section id="slide-org6e3f90f">
<h2 id="org6e3f90f">Implementing the other side</h2>
<p>
#+end_notes
</p>
</section>
</section>
<section>
<section id="slide-org7bba37d">
<h3 id="org7bba37d">The Map for a Monoid</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">class</span> <span class="org-type">Impl</span>&gt;
  <span class="org-keyword">requires</span> <span class="org-type">MonoidRequirements</span>&lt;
      <span class="org-type">Impl</span>,
      <span class="org-keyword">typename</span> <span class="org-constant">Impl</span>::<span class="org-type">value_type</span>&gt;
<span class="org-keyword">struct</span> <span class="org-type">Monoid</span> : <span class="org-keyword">protected</span> <span class="org-type">Impl</span> {
  <span class="org-keyword">auto</span> <span class="org-variable-name">identity</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self);

  <span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">Range</span>&gt;
  <span class="org-keyword">auto</span> <span class="org-variable-name">concat</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self, <span class="org-type">Range</span> <span class="org-variable-name">r</span>);

  <span class="org-keyword">auto</span> <span class="org-variable-name">op</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self, <span class="org-keyword">auto</span> <span class="org-variable-name">a1</span>, <span class="org-keyword">auto</span> <span class="org-variable-name">a2</span>);
};
</pre>
</div>
<aside class="notes">
<p>
empty is a terrible name, concat only a little better.
empty becomes identity
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org080f816">
<h4 id="org080f816"><code>identity</code></h4>
<div class="org-src-container">

<pre class="src src-c++">    <span class="org-keyword">auto</span> <span class="org-variable-name">identity</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span> &amp;&amp; self) {
        <span class="org-constant">std</span>::puts(<span class="org-string">"Monoid::identity()"</span>);
        <span class="org-keyword">return</span> self.concat(<span class="org-constant">std</span>::<span class="org-constant">ranges</span>::<span class="org-type">empty_view</span>&lt;<span class="org-keyword">typename</span> <span class="org-constant">Impl</span>::<span class="org-type">value_type</span>&gt;{});
    }

</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgd6ffb02">
<h4 id="orgd6ffb02"><code>concat</code></h4>
<div class="org-src-container">

<pre class="src src-c++">   <span class="org-keyword">template</span>&lt;<span class="org-keyword">typename</span> <span class="org-type">Range</span>&gt;
   <span class="org-keyword">auto</span> <span class="org-variable-name">concat</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self, <span class="org-type">Range</span> <span class="org-variable-name">r</span>) {
        <span class="org-constant">std</span>::puts(<span class="org-string">"Monoid::concat()"</span>);
        <span class="org-keyword">return</span> <span class="org-constant">std</span>::<span class="org-constant">ranges</span>::fold_right(r,
                    self.identity(),
                    [&amp;](<span class="org-keyword">auto</span> <span class="org-variable-name">m1</span>, <span class="org-keyword">auto</span> <span class="org-variable-name">m2</span>){<span class="org-keyword">return</span> self.op(m1, m2);});
    }

</pre>
</div>
</section>
</section>
<section>
<section id="slide-org1e6578f">
<h4 id="org1e6578f"><code>op</code></h4>
<div class="org-src-container">

<pre class="src src-c++">   <span class="org-keyword">auto</span> <span class="org-variable-name">op</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self, <span class="org-keyword">auto</span> <span class="org-variable-name">a1</span>, <span class="org-keyword">auto</span> <span class="org-variable-name">a2</span>) {
        <span class="org-constant">std</span>::puts(<span class="org-string">"Monoid::op"</span>);
        <span class="org-keyword">return</span> self.op(a1, a2);
    }
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org223675b">
<h3 id="org223675b">Deducing <code>this</code> <b>and</b> CRTP</h3>
<p>
We'll see in a moment, but it's because we want to constraint the required implementation.
</p>

<p>
We want to use the derived version which has all of the operations.
</p>
</section>
</section>
<section>
<section id="slide-org33e0898">
<h3 id="org33e0898"><code>Plus</code></h3>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">M</span>&gt;
<span class="org-keyword">class</span> <span class="org-type">Plus</span> {
<span class="org-keyword">public</span>:
  <span class="org-keyword">using</span> <span class="org-type">value_type</span> = M;
  <span class="org-keyword">auto</span> <span class="org-variable-name">identity</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self) -&gt; <span class="org-type">M</span> {
    <span class="org-constant">std</span>::puts(<span class="org-string">"Plus::identity()"</span>);
    <span class="org-keyword">return</span> M{0};
  }

  <span class="org-keyword">auto</span> <span class="org-variable-name">op</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self, <span class="org-keyword">auto</span> <span class="org-variable-name">s1</span>, <span class="org-keyword">auto</span> <span class="org-variable-name">s2</span>) -&gt; <span class="org-type">M</span> {
    <span class="org-constant">std</span>::puts(<span class="org-string">"Plus::op()"</span>);
    <span class="org-keyword">return</span> s1 + s2;
  }
};
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org72c6fd3">
<h3 id="org72c6fd3"><code>PlusMonoidMap</code></h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">typename</span> <span class="org-type">M</span>&gt;
<span class="org-keyword">struct</span> <span class="org-type">PlusMonoidMap</span> : <span class="org-keyword">public</span> <span class="org-type">Monoid</span>&lt;<span class="org-type">Plus</span>&lt;<span class="org-type">M</span>&gt;&gt; {
    <span class="org-keyword">using</span> <span class="org-constant">Plus</span>&lt;<span class="org-type">M</span>&gt;::identity;
    <span class="org-keyword">using</span> <span class="org-constant">Plus</span>&lt;<span class="org-type">M</span>&gt;::op;
};
</pre>
</div>
<aside class="notes">
<p>
Need to pull the operations from the Monoid instance into the Map, so we get the right ones being used by concat.
</p>

<p>
This might be simpler if we didn't allow choice of the basis operations, but that's also overly restrictive.
</p>

</aside>
</section>
</section>
