papers/cppnow24/concept_maps.org
** The map instances
#+begin_src c++
template<class T> auto monoid_concept_map = std::false_type{};

template<>
constexpr inline auto monoid_concept_map<int> = PlusMonoidMap<int>{};

template<>
constexpr inline auto monoid_concept_map<long> = PlusMonoidMap<long>{};

template<>
constexpr inline auto monoid_concept_map<char> = PlusMonoidMap<char>{};
#+end_src

** Can we ~concat~ instead?
#+begin_src c++
class StringMonoid {
public:
  using value_type = std::string;

  auto op(this auto&&, auto s1, auto s2) {
    std::puts("StringMonoid::op()");
    return s1 + s2;
  }

  template <typename Range>
  auto concat(this auto&& self, Range r) {
    std::puts("StringMonoid::concat()");
    return std::ranges::fold_right(
        r, std::string{}, [&](auto m1, auto m2) {
          return self.op(m1, m2);
        });
  }
};
#+end_src
#+begin_notes
No, I'm not properly constraining Range here.
No, I'm not actually recommending this as an implementation.
#+end_notes
** The Map and instance
#+begin_src c++
struct StringMonoidMap : public Monoid<StringMonoid> {
    using StringMonoid::op;
    using StringMonoid::concat;
};

template<>
constexpr inline auto monoid_concept_map<std::string> = StringMonoidMap{};

#+end_src

* Some simple use
** Exercise the functions
#+begin_src C++
template<typename P>
void testP()
{
    auto d1 = monoid_concept_map<P>;

    auto x = d1.identity();
    assert(P{} == x);

    auto sum = d1.op(x, P{1});
    assert(P{1} == sum);

    std::vector<P> v = {1,2,3,4};
    auto k = d1.concat(v);
    assert(k == 10);
}
#+end_src

** Some simple cases
#+begin_src c++
    std::cout << "\ntest int\n";
    testP<int>();

    std::cout << "\ntest long\n";
    testP<long>();

   std::cout << "\ntest char\n";
    testP<char>();

#+end_src
** On the StringMonoid
#+begin_src C++
    auto d2 = monoid_concept_map<std::string>;

    std::cout << "\ntest string\n";
    auto x2 = d2.identity();
    assert(std::string{} == x2);

    auto sum2 = d2.op(x2, "1");
    assert(std::string{"1"} == sum2);

    std::vector<std::string> vs = {"1","2","3","4"};
    auto k2 = d2.concat(vs);
    assert(k2 == std::string{"1234"});
#+end_src

** Results
*** test int
#+begin_example
Plus::identity()
Plus::op()
Monoid::concat()
Plus::identity()
Plus::op()
Plus::op()
Plus::op()
Plus::op()
#+end_example

*** test long
#+begin_example
Plus::identity()
Plus::op()
Monoid::concat()
Plus::identity()
Plus::op()
Plus::op()
Plus::op()
Plus::op()
#+end_example

*** test char
#+begin_example
Plus::identity()
Plus::op()
Monoid::concat()
Plus::identity()
Plus::op()
Plus::op()
Plus::op()
Plus::op()
#+end_example

*** test string
#+begin_example
Monoid::identity()
StringMonoid::concat()
StringMonoid::op()
StringMonoid::concat()
StringMonoid::op()
StringMonoid::op()
StringMonoid::op()
StringMonoid::op()
#+end_example

* Monoid in Trees

** Foldable generalizes
Folding is very much tied to Range like things.

It can, and has, been generalized to things that can be traversed.

~monoids~ are still critical for Traversables.

** Summarizing Data in a tree
If the summary type is monoidal nodes can hold summaries of all the data below them.

** ~fingertrees~
Much of the flexibility of ~fingertrees~ comes from the monoidal tags.

They are also fairly complicated.

Technique can be applied to other, simpler, trees.

** fringe-tree
Simplified tree with data at the edges

** Code
Show the monoid-map branch of

[[https://github.com/steve-downey/fringetree][steve-downey/fringetree.git]]

