papers/cppnow24/concept_maps.html
<section>
<section id="slide-orga091728">
<h3 id="orga091728">The map instances</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">T</span>&gt; <span class="org-keyword">auto</span> <span class="org-variable-name">monoid_concept_map</span> = <span class="org-constant">std</span>::false_type{};

<span class="org-keyword">template</span>&lt;&gt;
<span class="org-keyword">constexpr</span> <span class="org-keyword">inline</span> <span class="org-keyword">auto</span> <span class="org-type">monoid_concept_map</span><span class="org-variable-name">&lt;int&gt;</span> = <span class="org-type">PlusMonoidMap</span>&lt;<span class="org-type">int</span>&gt;{};

<span class="org-keyword">template</span>&lt;&gt;
<span class="org-keyword">constexpr</span> <span class="org-keyword">inline</span> <span class="org-keyword">auto</span> <span class="org-type">monoid_concept_map</span><span class="org-variable-name">&lt;long&gt;</span> = <span class="org-type">PlusMonoidMap</span>&lt;<span class="org-type">long</span>&gt;{};

<span class="org-keyword">template</span>&lt;&gt;
<span class="org-keyword">constexpr</span> <span class="org-keyword">inline</span> <span class="org-keyword">auto</span> <span class="org-type">monoid_concept_map</span><span class="org-variable-name">&lt;char&gt;</span> = <span class="org-type">PlusMonoidMap</span>&lt;<span class="org-type">char</span>&gt;{};
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org304a85d">
<h3 id="org304a85d">Can we <code>concat</code> instead?</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">StringMonoid</span> {
<span class="org-keyword">public</span>:
  <span class="org-keyword">using</span> <span class="org-type">value_type</span> = <span class="org-constant">std</span>::string;

  <span class="org-keyword">auto</span> <span class="org-variable-name">op</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp;, <span class="org-keyword">auto</span> <span class="org-variable-name">s1</span>, <span class="org-keyword">auto</span> <span class="org-variable-name">s2</span>) {
    <span class="org-constant">std</span>::puts(<span class="org-string">"StringMonoid::op()"</span>);
    <span class="org-keyword">return</span> s1 + s2;
  }

  <span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">Range</span>&gt;
  <span class="org-keyword">auto</span> <span class="org-variable-name">concat</span>(<span class="org-keyword">this</span> <span class="org-keyword">auto</span>&amp;&amp; self, <span class="org-type">Range</span> <span class="org-variable-name">r</span>) {
    <span class="org-constant">std</span>::puts(<span class="org-string">"StringMonoid::concat()"</span>);
    <span class="org-keyword">return</span> <span class="org-constant">std</span>::<span class="org-constant">ranges</span>::fold_right(
        r, <span class="org-constant">std</span>::string{}, [&amp;](<span class="org-keyword">auto</span> <span class="org-variable-name">m1</span>, <span class="org-keyword">auto</span> <span class="org-variable-name">m2</span>) {
          <span class="org-keyword">return</span> self.op(m1, m2);
        });
  }
};
</pre>
</div>
<aside class="notes">
<p>
No, I'm not properly constraining Range here.
No, I'm not actually recommending this as an implementation.
</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgf804d38">
<h3 id="orgf804d38">The Map and instance</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">struct</span> <span class="org-type">StringMonoidMap</span> : <span class="org-keyword">public</span> <span class="org-type">Monoid</span>&lt;StringMonoid&gt; {
    <span class="org-keyword">using</span> <span class="org-constant">StringMonoid</span>::op;
    <span class="org-keyword">using</span> <span class="org-constant">StringMonoid</span>::concat;
};

<span class="org-keyword">template</span>&lt;&gt;
<span class="org-keyword">constexpr</span> <span class="org-keyword">inline</span> <span class="org-keyword">auto</span> <span class="org-type">monoid_concept_map</span>&lt;<span class="org-constant">std</span>::<span class="org-variable-name">string&gt;</span> = StringMonoidMap{};

</pre>
</div>
</section>
</section>
<section>
<section id="slide-org1d621b6">
<h2 id="org1d621b6">Some simple use</h2>
<div class="outline-text-2" id="text-org1d621b6">
</div>
</section>
</section>
<section>
<section id="slide-org817e1f5">
<h3 id="org817e1f5">Exercise the functions</h3>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">typename</span> <span class="org-type">P</span>&gt;
<span class="org-type">void</span> <span class="org-function-name">testP</span>()
{
    <span class="org-keyword">auto</span> <span class="org-variable-name">d1</span> = <span class="org-type">monoid_concept_map</span>&lt;<span class="org-type">P</span>&gt;;

    <span class="org-keyword">auto</span> <span class="org-variable-name">x</span> = d1.identity();
    assert(P{} == x);

    <span class="org-keyword">auto</span> <span class="org-variable-name">sum</span> = d1.op(x, P{1});
    assert(P{1} == sum);

    <span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;<span class="org-type">P</span>&gt; <span class="org-variable-name">v</span> = {1,2,3,4};
    <span class="org-keyword">auto</span> <span class="org-variable-name">k</span> = d1.concat(v);
    assert(k == 10);
}
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org4864cd4">
<h3 id="org4864cd4">Some simple cases</h3>
<div class="org-src-container">

<pre class="src src-c++">    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\ntest int\n"</span>;
    testP&lt;<span class="org-type">int</span>&gt;();

    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\ntest long\n"</span>;
    testP&lt;<span class="org-type">long</span>&gt;();

   <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\ntest char\n"</span>;
    testP&lt;<span class="org-type">char</span>&gt;();

</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgaca0a82">
<h3 id="orgaca0a82">On the StringMonoid</h3>
<div class="org-src-container">

<pre class="src src-C++">    <span class="org-keyword">auto</span> <span class="org-variable-name">d2</span> = <span class="org-type">monoid_concept_map</span>&lt;<span class="org-constant">std</span>::string&gt;;

    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"\ntest string\n"</span>;
    <span class="org-keyword">auto</span> <span class="org-variable-name">x2</span> = d2.identity();
    assert(<span class="org-constant">std</span>::string{} == x2);

    <span class="org-keyword">auto</span> <span class="org-variable-name">sum2</span> = d2.op(x2, <span class="org-string">"1"</span>);
    assert(<span class="org-constant">std</span>::string{<span class="org-string">"1"</span>} == sum2);

    <span class="org-constant">std</span>::<span class="org-type">vector</span>&lt;<span class="org-constant">std</span>::string&gt; <span class="org-variable-name">vs</span> = {<span class="org-string">"1"</span>,<span class="org-string">"2"</span>,<span class="org-string">"3"</span>,<span class="org-string">"4"</span>};
    <span class="org-keyword">auto</span> <span class="org-variable-name">k2</span> = d2.concat(vs);
    assert(k2 == <span class="org-constant">std</span>::string{<span class="org-string">"1234"</span>});
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org7f47430">
<h3 id="org7f47430">Results</h3>
<div class="outline-text-3" id="text-org7f47430">
</div>
</section>
</section>
<section>
<section id="slide-orgad3261a">
<h4 id="orgad3261a">test int</h4>
<pre class="example" id="org755c099">
Plus::identity()
Plus::op()
Monoid::concat()
Plus::identity()
Plus::op()
Plus::op()
Plus::op()
Plus::op()
</pre>
</section>
</section>
<section>
<section id="slide-orgcae6688">
<h4 id="orgcae6688">test long</h4>
<pre class="example" id="org2391245">
Plus::identity()
Plus::op()
Monoid::concat()
Plus::identity()
Plus::op()
Plus::op()
Plus::op()
Plus::op()
</pre>
</section>
</section>
<section>
<section id="slide-orgb79124b">
<h4 id="orgb79124b">test char</h4>
<pre class="example" id="orgbf0fbc9">
Plus::identity()
Plus::op()
Monoid::concat()
Plus::identity()
Plus::op()
Plus::op()
Plus::op()
Plus::op()
</pre>
</section>
</section>
<section>
<section id="slide-orgcccbd38">
<h4 id="orgcccbd38">test string</h4>
<pre class="example" id="org872e991">
Monoid::identity()
StringMonoid::concat()
StringMonoid::op()
StringMonoid::concat()
StringMonoid::op()
StringMonoid::op()
StringMonoid::op()
StringMonoid::op()
</pre>
</section>
</section>
<section>
<section id="slide-orgd475401">
<h2 id="orgd475401">Monoid in Trees</h2>
<div class="outline-text-2" id="text-orgd475401">
</div>
</section>
</section>
<section>
<section id="slide-org6451746">
<h3 id="org6451746">Foldable generalizes</h3>
<p>
Folding is very much tied to Range like things.
</p>

<p>
It can, and has, been generalized to things that can be traversed.
</p>

<p>
<code>monoids</code> are still critical for Traversables.
</p>
</section>
</section>
<section>
<section id="slide-orgc0cddac">
<h3 id="orgc0cddac">Summarizing Data in a tree</h3>
<p>
If the summary type is monoidal nodes can hold summaries of all the data below them.
</p>
</section>
</section>
<section>
<section id="slide-orgc1323ea">
<h3 id="orgc1323ea"><code>fingertrees</code></h3>
<p>
Much of the flexibility of <code>fingertrees</code> comes from the monoidal tags.
</p>

<p>
They are also fairly complicated.
</p>

<p>
Technique can be applied to other, simpler, trees.
</p>
</section>
</section>
<section>
<section id="slide-org2f1cf2e">
<h3 id="org2f1cf2e">fringe-tree</h3>
<p>
Simplified tree with data at the edges
</p>
</section>
</section>
<section>
<section id="slide-org588c37a">
<h3 id="org588c37a">Code</h3>
<p>
Show the monoid-map branch of
</p>

<p>
<a href="https://github.com/steve-downey/fringetree">steve-downey/fringetree.git</a>
</p>
</section>
</section>
